In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split, cross_val_score
from sklearn.naive_bayes import GaussianNB

#### Basic reading of Dataset

In [2]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

#### Cleaning the dataset

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [5]:
input = df.drop('Survived', axis='columns')
target = df['Survived']

In [6]:
dummies = pd.get_dummies(input['Sex'])
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [7]:
input_new = pd.concat([input, dummies], axis='columns')
input_new.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [8]:
input_new.drop('Sex', axis='columns', inplace=True)
input_new.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [9]:
input_new.head(900)

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [10]:
input_new['Age'] = input_new['Age'].fillna(input_new['Age'].mean())
input_new.head(900)

     Pclass        Age     Fare  female  male
0         3  22.000000   7.2500       0     1
1         1  38.000000  71.2833       1     0
2         3  26.000000   7.9250       1     0
3         1  35.000000  53.1000       1     0
4         3  35.000000   8.0500       0     1
..      ...        ...      ...     ...   ...
886       2  27.000000  13.0000       0     1
887       1  19.000000  30.0000       1     0
888       3  29.699118  23.4500       1     0
889       1  26.000000  30.0000       0     1
890       3  32.000000   7.7500       0     1

[891 rows x 5 columns]

#### Training the dataset

In [21]:
# x = input_new
# y = target
X_train, X_test, y_train, y_test = train_test_split(input_new, target, test_size=0.2)

In [13]:
len(X_train)

712

In [14]:
len(X_test)

179

In [15]:
len(input_new)

891

In [22]:
model = GaussianNB()

In [23]:
model.fit(X_train, y_train)

GaussianNB()

In [24]:
# Accuracy of model
print('The accuracy of the model is',model.score(X_test, y_test)*100,'%')

The accuracy of the model is 78.77094972067039 %

In [25]:
X_test[0:10]

     Pclass        Age      Fare  female  male
735       3  28.500000   16.1000       0     1
123       2  32.500000   13.0000       1     0
759       1  33.000000   86.5000       1     0
249       2  54.000000   26.0000       0     1
734       2  23.000000   13.0000       0     1
15        2  55.000000   16.0000       1     0
373       1  22.000000  135.6333       0     1
447       1  34.000000   26.5500       0     1
692       3  29.699118   56.4958       0     1
811       3  39.000000   24.1500       0     1

In [26]:
y_test[0:10]

735    0
123    1
759    1
249    0
734    0
15     1
373    0
447    1
692    1
811    0
Name: Survived, dtype: int64

In [27]:
model.predict(X_test[0:10])

array([0, 1, 1, 0, 0, 1, 1, 0, 0, 0], dtype=int64)

In [28]:
model.predict_proba(X_test[:10])

array([[0.99143627, 0.00856373],
       [0.04213273, 0.95786727],
       [0.00106647, 0.99893353],
       [0.97735742, 0.02264258],
       [0.97754161, 0.02245839],
       [0.03790381, 0.96209619],
       [0.01319099, 0.98680901],
       [0.92326025, 0.07673975],
       [0.98163959, 0.01836041],
       [0.99175777, 0.00824223]])

#### Calculating the cross validation

In [29]:
cross_val_score(GaussianNB(), X_train, y_train, cv=5)

array([0.76923077, 0.7972028 , 0.79577465, 0.79577465, 0.76056338])